---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotVisible
source: html/aab7733f-c86e-c05f-9e5a-f59e1ddd56a1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalPanelNotVisible Property

Analytical Panel is not visible in the current view.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalPanelNotVisible { get; }
```